Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
utObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginGnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryGTF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryGTF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCFsubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCFsubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].aws_api_gateway_authorizer.svep_user_pool_authorizer will be created
  + resource "aws_api_gateway_authorizer" "svep_user_pool_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "sbeacon-userpool-authorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi will be created
  + resource "aws_api_gateway_deployment" "VPApi" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-options will be created
  + resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch will be created
  + resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post will be created
  + resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-options will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-options will be created
  + resource "aws_api_gateway_method" "vcfstats-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch will be created
  + resource "aws_api_gateway_method" "vcfstats-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-post will be created
  + resource "aws_api_gateway_method" "vcfstats-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method_response.results-get will be created
  + resource "aws_api_gateway_method_response" "results-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-patch will be created
  + resource "aws_api_gateway_method_response" "submit-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-post will be created
  + resource "aws_api_gateway_method_response" "submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-options will be created
  + resource "aws_api_gateway_method_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-patch will be created
  + resource "aws_api_gateway_method_response" "vcfstats-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-post will be created
  + resource "aws_api_gateway_method_response" "vcfstats-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_settings.VPApi will be created
  + resource "aws_api_gateway_method_settings" "VPApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 1000
          + throttling_rate_limit                      = 100
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.svep[0].aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "results"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "submit"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.vcfstats will be created
  + resource "aws_api_gateway_resource" "vcfstats" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "vcfstats"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_rest_api.VPApi will be created
  + resource "aws_api_gateway_rest_api" "VPApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API That implements the Variant Prioritization specification"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "svep-backend-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.svep[0].aws_api_gateway_stage.VPApi will be created
  + resource "aws_api_gateway_stage" "VPApi" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.svep[0].aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "svep-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.svep[0].aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "svep-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + target_origin_id         = "svep-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "svep-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.svep[0].aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "svep-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.svep[0].aws_cloudwatch_event_rule.update_references_trigger will be created
  + resource "aws_cloudwatch_event_rule" "update_references_trigger" {
      + arn                 = (known after apply)
      + description         = "A scheduled trigger that checks for changes to and updates reference files used by sVEP."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "svep_update_references_trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags_all            = (known after apply)
    }

  # module.svep[0].aws_cloudwatch_event_target.update_references_trigger will be created
  + resource "aws_cloudwatch_event_target" "update_references_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "svep_update_references_trigger"
      + target_id      = "lambda-updateReferenceFiles"
    }

  # module.svep[0].aws_dynamodb_table.svep_references will be created
  + resource "aws_dynamodb_table" "svep_references" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "svep-references"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.svep[0].aws_iam_instance_profile.ec2_references_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_references_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "svep_backend_ec2_references_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "svep_backend_ec2_references_instance_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.svep[0].aws_iam_role.ec2_references_instance_role will be created
  + resource "aws_iam_role" "ec2_references_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep_backend_ec2_references_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].aws_iam_role_policy.ec2_references_policy will be created
  + resource "aws_iam_role_policy" "ec2_references_policy" {
      + id          = (known after apply)
      + name        = "svep_backend_ec2_references_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.svep[0].aws_lambda_event_source_mapping.clinic_jobs_stream_event_source will be created
  + resource "aws_lambda_event_source_mapping" "clinic_jobs_stream_event_source" {
      + arn                           = (known after apply)
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = "svep-backend-clearTempAndRegions"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName = [
                          + "MODIFY",
                        ]
                    }
                )
            }
        }

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion will be created
  + resource "aws_lambda_function_recursion_config" "concat_starter_recursion" {
      + function_name  = "svep-backend-concatStarter"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion will be created
  + resource "aws_lambda_function_recursion_config" "create_pages_recursion" {
      + function_name  = "svep-backend-createPages"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.init_query_recursion will be created
  + resource "aws_lambda_function_recursion_config" "init_query_recursion" {
      + function_name  = "svep-backend-initQuery"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion will be created
  + resource "aws_lambda_function_recursion_config" "plugin_consequence_recursion" {
      + function_name  = "svep-backend-pluginConsequence"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_gtf_recursion" {
      + function_name  = "svep-backend-queryGTF"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_vcf_recursion" {
      + function_name  = "svep-backend-queryVCF"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.update_reference_files_recursion will be created
  + resource "aws_lambda_function_recursion_config" "update_reference_files_recursion" {
      + function_name  = "svep-backend-updateReferenceFiles"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "svep/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_binaries_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concat"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatPagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_starter_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_starter_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatStarter"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatStarterAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.create_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "create_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-createPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSCreatePagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.formatOutput_invoke_permission will be created
  + resource "aws_lambda_permission" "formatOutput_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-formatOutput"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSformatOutputAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.get_results_invoke_permission will be created
  + resource "aws_lambda_permission" "get_results_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "APIGetResultsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.init_query_invoke_permission will be created
  + resource "aws_lambda_permission" "init_query_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-initQuery"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "APIInitQueryAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_clinvar_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginClinvar"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginClinvarAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_consequence_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginConsequence"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginConsequenceAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomad"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_send_job_email_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-sendJobEmail"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSSendJobEmailAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_gtf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_gtf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryGTF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryGTFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryVCFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_submit_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCFsubmit"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryVCFSubmitAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.sns_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "sns_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission will be created
  + resource "aws_lambda_permission" "vcfstats_graphic_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-qcFigures"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "APIVcfstatsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-layers-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-references will be created
  + resource "aws_s3_bucket" "svep-references" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-references-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-regions will be created
  + resource "aws_s3_bucket" "svep-regions" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-regions-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-results will be created
  + resource "aws_s3_bucket" "svep-results" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-results-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      +
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.